import type { News } from "../types";

export const dummyNews: News[] = [
  {
    id: 1,
    image: "/imgs/ad.jpg",
    name: "DEWALT x McLaren საკოლექციო მოდელები",
    date: "25.05.2025",
    description:
      "DEWALT-მა და McLaren Formula 1-მა ერთად შექმნეს შეზღუდული რაოდენობის კოლექცია, რომელიც აერთიანებს DEWALT-ის საიმედოობას და McLaren-ის მაღალშესრულებადობას.",
    fullContent:
      "DEWALT-მა და McLaren Formula 1-მა ერთად შექმნეს შეზღუდული რაოდენობის კოლექცია, რომელიც აერთიანებს DEWALT-ის საიმედოობას და McLaren-ის მაღალშესრულებადობას. ეს კოლექცია შექმნილია პროფესიონალებისთვის, რომლებიც საჭიროებენ უკიდურეს პირობებში მუშაობის უნარს. ყველა პროდუქტი გამოირჩევა განსაკუთრებული დიზაინით და McLaren-ის ბრენდინგით, რაც ხდის მათ კოლექციონერულ ღირებულებას. კოლექცია მოიცავს ხელსაწყოებს, ბატარეებს და აქსესუარებს, რომლებიც შექმნილია Formula 1-ის სტანდარტებით.",
  },
  {
    id: 2,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "24.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 3,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "23.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 4,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "22.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 5,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "21.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 6,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "20.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 7,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "19.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 8,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "18.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 9,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "17.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 10,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "16.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 11,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "15.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 12,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "14.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 13,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "13.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 14,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "12.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 15,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "11.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 16,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "10.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 17,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "09.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 18,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "08.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 19,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "07.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 20,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "06.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 21,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "05.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 22,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "04.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 23,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "03.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 24,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "02.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
  {
    id: 25,
    image: "/imgs/ad.jpg",
    name: "DEWALT XR+ POWERSTACK ახალი თაობის ბატარეები.",
    date: "01.05.2023",
    description:
      "ახალი, ინოვაციური ტექნოლოგიით დამზადებული ბატარეები, რომლებიც გამოირჩევიან მაღალი სიმძლავრით და კომპაქტური ზომით.",
  },
];

